In [1]:
import pandas as pd
import numpy as np

In [3]:
asx = [i for i in range(1,5)]
bsx = [i for i in range(5,9)]
csx = [i for i in range(9,13)]

In [4]:
df = pd.DataFrame(data=[asx,bsx,csx],
            index='a b c'.split(),
            columns='w x y z'.split())
df

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [5]:
pd.DataFrame(data=list(zip(asx,bsx,csx)),
            index = 'w x y z'.split(),
            columns = 'a b c'.split())

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [6]:
df

   w   x   y   z
a  1   2   3   4
b  5   6   7   8
c  9  10  11  12

In [7]:
df.loc['new']=[2,4,6,8]
df

     w   x   y   z
a    1   2   3   4
b    5   6   7   8
c    9  10  11  12
new  2   4   6   8

In [8]:
df['new'] = df['w'] + df['y']
df

     w   x   y   z  new
a    1   2   3   4    4
b    5   6   7   8   12
c    9  10  11  12   20
new  2   4   6   8    8

In [9]:
df.insert(2,'apa',[1,2,3,4])
df

     w   x  apa   y   z  new
a    1   2    1   3   4    4
b    5   6    2   7   8   12
c    9  10    3  11  12   20
new  2   4    4   6   8    8

In [10]:
df.drop('new',axis=1)

     w   x  apa   y   z
a    1   2    1   3   4
b    5   6    2   7   8
c    9  10    3  11  12
new  2   4    4   6   8

In [11]:
df

     w   x  apa   y   z  new
a    1   2    1   3   4    4
b    5   6    2   7   8   12
c    9  10    3  11  12   20
new  2   4    4   6   8    8

In [12]:
df.reset_index()

  index  w   x  apa   y   z  new
0     a  1   2    1   3   4    4
1     b  5   6    2   7   8   12
2     c  9  10    3  11  12   20
3   new  2   4    4   6   8    8

In [16]:
newind = 'CA NB WC OD'.split()
newind

['CA', 'NB', 'WC', 'OD']

In [17]:
df['states'] = newind
df

     w   x  apa   y   z  new states
a    1   2    1   3   4    4     CA
b    5   6    2   7   8   12     NB
c    9  10    3  11  12   20     WC
new  2   4    4   6   8    8     OD

In [18]:
df.set_index('states')

        w   x  apa   y   z  new
states
CA      1   2    1   3   4    4
NB      5   6    2   7   8   12
WC      9  10    3  11  12   20
OD      2   4    4   6   8    8

In [19]:
df

     w   x  apa   y   z  new states
a    1   2    1   3   4    4     CA
b    5   6    2   7   8   12     NB
c    9  10    3  11  12   20     WC
new  2   4    4   6   8    8     OD

In [20]:
df.set_index('states',inplace=True)
df

        w   x  apa   y   z  new
states
CA      1   2    1   3   4    4
NB      5   6    2   7   8   12
WC      9  10    3  11  12   20
OD      2   4    4   6   8    8

In [21]:
outside = ['Jakarta','Jakarta','Jakarta','Bandung','Bandung','Bandung']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('Jakarta', 1),
 ('Jakarta', 2),
 ('Jakarta', 3),
 ('Bandung', 1),
 ('Bandung', 2),
 ('Bandung', 3)]

In [22]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('Jakarta', 1),
            ('Jakarta', 2),
            ('Jakarta', 3),
            ('Bandung', 1),
            ('Bandung', 2),
            ('Bandung', 3)],
           )

In [23]:
df = pd.DataFrame(np.random.randint(1,100,(6,2)),
index = hier_index,
columns = ['Restauran A','Restauran B'])
df

           Restauran A  Restauran B
Jakarta 1           26           13
        2           75           45
        3           98           75
Bandung 1           82           71
        2           16           39
        3           48           88

In [25]:
df.loc['Jakarta']

   Restauran A  Restauran B
1           26           13
2           75           45
3           98           75

In [26]:
df.loc['Jakarta'].loc[1]

Restauran A    26
Restauran B    13
Name: 1, dtype: int32

In [27]:
df.xs('Jakarta')

   Restauran A  Restauran B
1           26           13
2           75           45
3           98           75

In [28]:
df.xs(['Jakarta',1])

Restauran A    26
Restauran B    13
Name: (Jakarta, 1), dtype: int32

In [29]:
df.index.names

FrozenList([None, None])

In [30]:
df.index.names = ['City','Location']
df

                  Restauran A  Restauran B
City    Location
Jakarta 1                  26           13
        2                  75           45
        3                  98           75
Bandung 1                  82           71
        2                  16           39
        3                  48           88

In [31]:
df.xs(1,level = 'Location')

         Restauran A  Restauran B
City
Jakarta           26           13
Bandung           82           71

In [38]:
df.sort_values('Restauran A')

                  Restauran A  Restauran B
City    Location
Bandung 2                  16           39
Jakarta 1                  26           13
Bandung 3                  48           88
Jakarta 2                  75           45
Bandung 1                  82           71
Jakarta 3                  98           75

In [40]:
df.sort_values('Restauran A',ascending=True)

                  Restauran A  Restauran B
City    Location
Bandung 2                  16           39
Jakarta 1                  26           13
Bandung 3                  48           88
Jakarta 2                  75           45
Bandung 1                  82           71
Jakarta 3                  98           75

In [41]:
df.sort_values('Restauran A',ascending=False)

                  Restauran A  Restauran B
City    Location
Jakarta 3                  98           75
Bandung 1                  82           71
Jakarta 2                  75           45
Bandung 3                  48           88
Jakarta 1                  26           13
Bandung 2                  16           39

In [45]:
df.sort_values('Restauran A',ascending=False,inplace=True)
df

                  Restauran A  Restauran B
City    Location
Jakarta 3                  98           75
Bandung 1                  82           71
Jakarta 2                  75           45
Bandung 3                  48           88
Jakarta 1                  26           13
Bandung 2                  16           39

In [46]:
df.sort_values(by=['Restauran A','Restauran B'])

                  Restauran A  Restauran B
City    Location
Bandung 2                  16           39
Jakarta 1                  26           13
Bandung 3                  48           88
Jakarta 2                  75           45
Bandung 1                  82           71
Jakarta 3                  98           75

In [48]:
df.sort_values(by=['Restauran A','Restauran B'],
ascending=[False,False])

                  Restauran A  Restauran B
City    Location
Jakarta 3                  98           75
Bandung 1                  82           71
Jakarta 2                  75           45
Bandung 3                  48           88
Jakarta 1                  26           13
Bandung 2                  16           39

In [49]:
df.sort_values(by=['Restauran A','Restauran B'],
ascending=[False,False],
inplace=True)
df

                  Restauran A  Restauran B
City    Location
Jakarta 3                  98           75
Bandung 1                  82           71
Jakarta 2                  75           45
Bandung 3                  48           88
Jakarta 1                  26           13
Bandung 2                  16           39

In [50]:
df.sort_index()

                  Restauran A  Restauran B
City    Location
Bandung 1                  82           71
        2                  16           39
        3                  48           88
Jakarta 1                  26           13
        2                  75           45
        3                  98           75

In [52]:
df.sort_index(inplace=True)
df

                  Restauran A  Restauran B
City    Location
Bandung 1                  82           71
        2                  16           39
        3                  48           88
Jakarta 1                  26           13
        2                  75           45
        3                  98           75